Dataset/Advanced/obliqueShock_LES/GT_Files/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
    model           Smagorinsky;
    turbulence      on;           // ✅ This is the missing keyword
    printCoeffs     on;
    delta           cubeRootVol;

    SmagorinskyCoeffs
    {
        Cs          0.17;
    }
}

// ************************************************************************* //
